Revit 2027 API
UpdaterData.GetDocument Method
 Returns document associated with this UpdaterData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document GetDocument()
Public Function GetDocument As Document
public:
Document^ GetDocument()
member GetDocument : unit -> Document
Return Value
Document
See Also
Reference
UpdaterData Class
Autodesk.Revit.DB Namespace